In [7]:
#Concatenate
import numpy as np
import pandas as pd  
a_data = pd.Series(['p', 'q'])  
b_data = pd.Series(['r', 's'])  
pd.concat([a_data, b_data])

0    p
1    q
0    r
1    s
dtype: object

In [2]:
#Append
one = pd.DataFrame({  
   'Name': ['Parker', 'Smith', 'Allen', 'John', 'Parker'],  
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],  
   'Marks_scored':[98,90,87,69,78]},  
   index=[1,2,3,4,5])  
two = pd.DataFrame({  
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],  
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],  
   'Marks_scored':[89,80,79,97,88]},  
   index=[1,2,3,4,5])  
print (one.append(two))

     Name subject_id  Marks_scored
1  Parker       sub1            98
2   Smith       sub2            90
3   Allen       sub4            87
4    John       sub6            69
5  Parker       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

C:\Users\prana\AppData\Local\Temp\ipykernel_16352\2983591891.py:12: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  print (one.append(two))

In [3]:
#Merge
left = pd.DataFrame({  
   'id':[1,2,3,4],  
   'Name': ['John', 'Parker', 'Smith', 'Parker'],  
   'subject_id':['sub1','sub2','sub4','sub6']})  
right = pd.DataFrame({  
    'id':[1,2,3,4],  
   'Name': ['William', 'Albert', 'Tony', 'Allen'],  
   'subject_id':['sub2','sub4','sub3','sub6']})  
print (left)  
print (right)

   id    Name subject_id
0   1    John       sub1
1   2  Parker       sub2
2   3   Smith       sub4
3   4  Parker       sub6
   id     Name subject_id
0   1  William       sub2
1   2   Albert       sub4
2   3     Tony       sub3
3   4    Allen       sub6

In [4]:
#Join
info = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],  
'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})  
x = pd.DataFrame({'key': ['K0', 'K1', 'K2'],  
'B': ['B0', 'B1', 'B2']})  
info.join(x, lsuffix='_caller', rsuffix='_x')   
info.set_index('key').join(x.set_index('key'))  
info.join(x.set_index('key'), on='key')

  key   A    B
0  K0  A0   B0
1  K1  A1   B1
2  K2  A2   B2
3  K3  A3  NaN
4  K4  A4  NaN
5  K5  A5  NaN

In [8]:
#Aggregation
info=pd.DataFrame([[1,5,7],[10,12,15],[18,21,24],[np.nan,np.nan,np.nan]],columns=['X','Y','Z'])  
info.agg(['sum','min'])

        X     Y     Z
sum  29.0  38.0  46.0
min   1.0   5.0   7.0

In [9]:
#Grouping
data = {'Name': ['Parker', 'Smith', 'John', 'William'],  
   'Percentage': [82, 98, 91, 87],  
   'Course': ['B.Sc','B.Ed','M.Phill','BA']}  
df = pd.DataFrame(data)  
grouped = df.groupby('Course')  
print(grouped['Percentage'].agg(np.mean))

Course
B.Ed       98.0
B.Sc       82.0
BA         87.0
M.Phill    91.0
Name: Percentage, dtype: float64

In [10]:
#Pivot Tables
# create dataframe   
info = pd.DataFrame({'P': ['Smith', 'John', 'William', 'Parker'],   
      'Q': ['Python', 'C', 'C++', 'Java'],   
      'R': [19, 24, 22, 25]})   
info   
table = pd.pivot_table(info, index =['P', 'Q'])     
table

                 R
P       Q
John    C       24
Parker  Java    25
Smith   Python  19
William C++     22